zIDENTIFICATION DIVISION.
PROGRAM-ID. VSAMREAD.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CUSTFILE ASSIGN TO VSAMDD
        ORGANIZATION IS INDEXED
        ACCESS MODE IS SEQUENTIAL
        RECORD KEY IS CUST-KEY.
DATA DIVISION.
FILE SECTION.
FD  CUSTFILE.
01  CUST-REC.
    05 CUST-KEY       PIC X(10).
    05 CUST-NAME      PIC X(30).
    05 CUST-BALANCE   PIC S9(9)V99.
WORKING-STORAGE SECTION.
01  EOF-SW       PIC X VALUE 'N'.
    88 EOF        VALUE 'Y'.
    88 NOT-EOF    VALUE 'N'.
PROCEDURE DIVISION.
    OPEN INPUT CUSTFILE.
    PERFORM UNTIL EOF
       READ CUSTFILE
           AT END SET EOF TO TRUE
           NOT AT END
              DISPLAY 'KEY=' CUST-KEY
              DISPLAY 'NAME=' CUST-NAME
              DISPLAY 'BAL=' CUST-BALANCE
       END-READ
    END-PERFORM.
    CLOSE CUSTFILE.
    STOP RUN.
