IDENTIFICATION DIVISION.
PROGRAM-ID. SEQIO.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INFILE  ASSIGN TO DDNAME-IN.
    SELECT OUTFILE ASSIGN TO DDNAME-OUT.
DATA DIVISION.
FILE SECTION.
FD  INFILE.
01  IN-REC  PIC X(80).
FD  OUTFILE.
01  OUT-REC PIC X(80).
WORKING-STORAGE SECTION.
01  EOF-SW       PIC X VALUE 'N'.
    88 EOF        VALUE 'Y'.
    88 NOT-EOF    VALUE 'N'.
PROCEDURE DIVISION.
    OPEN INPUT INFILE
         OUTPUT OUTFILE.
    PERFORM UNTIL EOF
       READ INFILE
           AT END SET EOF TO TRUE
           NOT AT END
              MOVE IN-REC TO OUT-REC
              WRITE OUT-REC
       END-READ
    END-PERFORM.
    CLOSE INFILE OUTFILE.
    STOP RUN.
