      ******************************************************************
      *        PROGRAM NAME            : HELLOCOBOL                    *
      *        DESCRIPTION             : SAYS "HELLO" TO USER IN SPOOL *
      *        CREDITS                 : EDUCATORS AND TRAINERS        *
      ******************************************************************
       
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOCOBOL.

       PROCEDURE DIVISION.
           DISPLAY "HELLO, DUNIYA"
           STOP RUN.
