       IDENTIFICATION DIVISION.
       PROGRAM-ID. SORTING.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION. 
       FILE-CONTROL.
           SELECT INFILE   ASSIGN TO "IN.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT OUTFILE  ASSIGN TO "OUT.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

           SELECT WORKFILE ASSIGN TO "WORK.txt"
           ORGANIZATION IS LINE SEQUENTIAL.  

       DATA DIVISION.
       FILE SECTION.

       FD INFILE.
       01 IN-EMP-ID         PIC 9(6).
       01 IN-EMP-NAME       PIC X(20).

       FD OUTFILE.
       01 OUT-EMP-ID         PIC 9(6).
       01 OUT-EMP-NAME       PIC X(20).
       
       SD WORKFILE.
       01 WK-EMP-ID         PIC 9(6).
       01 WK-EMP-NAME       PIC X(20).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY 'INSIDE A COBOL PROGRAM FOR INTERNAL SORTING'
           
           SORT WORKFILE ON ASCENDING KEY OUT-EMP-ID
           USING INFILE GIVING OUTFILE.

           DISPLAY 'SORTING IS DONE'
           STOP RUN.
           
