IDENTIFICATION DIVISION.
PROGRAM-ID. CICSHI01.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-MESSAGE          PIC X(40)
    VALUE 'WELCOME TO COBOL-CICS SAMPLE PROGRAM'.
01  WS-LENGTH           PIC S9(4) COMP.

PROCEDURE DIVISION.
MAIN-LOGIC.

    MOVE LENGTH OF WS-MESSAGE TO WS-LENGTH.

*   SEND A SIMPLE TEXT MESSAGE TO THE TERMINAL
    EXEC CICS SEND TEXT
         FROM   (WS-MESSAGE)
         LENGTH (WS-LENGTH)
         ERASE
    END-EXEC.

*   RETURN CONTROL TO CICS (END OF TRANSACTION)
    EXEC CICS RETURN
    END-EXEC.

    GOBACK.
