//DB2LOAD JOB (ACCT),'DB2 LOAD',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=DSNUTILB,REGION=0M,
//             PARM='DB2SSID,LOADJOB'
//STEPLIB  DD  DISP=SHR,DSN=DB2.SDSNLOAD
//SYSIN    DD  *
  LOAD DATA INDDN SYSREC
       INTO TABLE YOURDB.EMPLOYEE
       LOG NO
/*
//SYSREC   DD  DSN=YOUR.INPUT.EMP.DATA,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//UTPRINT  DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
