//HELLOJOB JOB (ACCT),'HELLO',CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1)
//STEP1    EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT1   DD  *
//HELLO, MAINFRAME WORLD
/*
//SYSUT2   DD  SYSOUT=*
